Repository: haitnmt/TraCuuGcn
Catalog: src/app/tracuugcn_app/lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Certificate Information
vi: Tra cứu GCN

# appVersion
source: Version: 1.0.0
vi: Phiên bản: 1.0.0

# appDescription
source: Certificate Information Lookup
vi: Tra cứu thông tin Giấy Chứng Nhận

# searchHintText
source: Enter QR code, barcode, serial number or certificate number!
vi: Nhập thông tin mã Qr, mã vạch, số phát hành (Serial) hoặc mã Giấy chứng nhận!

# mobileSearchHintText
source: Enter lookup information!
vi: Nhập thông tin tra cứu!

# helperText
source: QR Code, Barcode, Serial Number or Certificate Number
vi: Mã QR, Mã vạch, Số phát hành (Serial) hoặc Mã Giấy chứng nhận

# imageFeatureMessage
source: Image selection feature will be added!
vi: Chức năng chọn ảnh sẽ được thêm vào!

# qrFeatureMessage
source: QR scanning feature will be added!
vi: Chức năng quét QR sẽ được thêm vào!

# searchFeatureMessage
source: Search feature will be added!
vi: Chức năng tìm kiếm sẽ được thêm vào!

# logoutSuccessMessage
source: Logged out successfully!
vi: Đã đăng xuất thành công!

# helpDialogTitle
source: Lookup Guide
vi: Hướng dẫn tra cứu

# aboutDialogTitle
source: About
vi: Về ứng dụng

# logoutDialogTitle
source: Confirm Logout
vi: Xác nhận đăng xuất

# languageDialogTitle
source: Select Language
vi: Chọn ngôn ngữ

# imageTooltip
source: Select image from gallery
vi: Chọn ảnh từ thư viện

# qrTooltip
source: Scan QR code
vi: Quét mã QR

# sendTooltip
source: Send lookup request
vi: Gửi yêu cầu tra cứu

# helpTooltip
source: Input guide
vi: Hướng dẫn nhập thông tin

# aboutTooltip
source: About us
vi: Về chúng tôi

# logoutTooltip
source: Logout
vi: Đăng xuất

# homeMenuItem
source: Home
vi: Trang chủ

# searchMenuItem
source: Search
vi: Tra cứu

# historyMenuItem
source: Search History
vi: Lịch sử tra cứu

# settingsMenuItem
source: Settings
vi: Cài đặt

# languageMenuItem
source: Language
vi: Ngôn ngữ

# closeButton
source: Close
vi: Đóng

# cancelButton
source: Cancel
vi: Hủy

# logoutButton
source: Logout
vi: Đăng xuất

# understoodButton
source: Understood
vi: Đã hiểu

# selectButton
source: Select
vi: Chọn

# helpIntroText
source: You can search using one of the following information:
vi: Bạn có thể tra cứu bằng một trong các thông tin sau:

# helpQrText
source: 🔍 QR Code:
vi: 🔍 Mã QR Code:

# helpQrDescription
source: • Scan directly from certificate
vi: • Quét trực tiếp từ giấy chứng nhận

# helpBarcodeText
source: 📱 Barcode:
vi: 📱 Mã vạch (Barcode):

# helpBarcodeDescription
source: • Numbers below barcode on certificate
vi: • Dãy số dưới mã vạch trên GCN

# helpSerialText
source: 🔢 Serial Number:
vi: 🔢 Số phát hành (Serial):

# helpSerialDescription
source: • Serial number on certificate
vi: • Số sê-ri ghi trên giấy chứng nhận

# helpSerialExample
source: • Example: BN-001234567
vi: • Ví dụ: BN-001234567

# helpGcnText
source: 📄 Certificate Number:
vi: 📄 Mã Giấy chứng nhận:

# helpGcnDescription
source: • Certificate ID on document
vi: • Mã số GCN ghi trên tài liệu

# helpGcnExample
source: • Example: 27-T-123456789
vi: • Ví dụ: 27-T-123456789

# helpNoteText
source: Note: Only need to enter one of the above information to search.
vi: Lưu ý: Chỉ cần nhập một trong các thông tin trên để tra cứu.

# mainTitle1
source: LOOK UP INFORMATION
vi: TRA CỨU THÔNG TIN

# mainTitle2
source: CERTIFICATE
vi: GIẤY CHỨNG NHẬN

# mainSubtitle
source: LAND USE RIGHTS, OWNERSHIP OF ASSETS ATTACHED TO LAND
vi: QUYỀN SỬ DỤNG ĐẤT, QUYỀN SỞ HỮU TÀI SẢN GẮN LIỀN VỚI ĐẤT

# mainSubtitleMobile
source: LAND USE RIGHTS, OWNERSHIP OF ASSETS ATTACHED TO LAND
vi: QUYỀN SỬ DỤNG ĐẤT, QUYỀN SỞ HỮU TÀI SẢN GẮN LIỀN VỚI ĐẤT

# logoutConfirmMessage
source: Are you sure you want to logout from the application?
vi: Bạn có chắc chắn muốn đăng xuất khỏi ứng dụng?

source: Clear History
vi: Xóa lịch sử

source: hours ago
vi: giờ trước

source: days ago
vi: ngày trước

# loginButton
source: Login
vi: Đăng nhập

# loginSuccess
source: Login successful
vi: Đăng nhập thành công

# loginSSOButton
source: SSO Login
vi: Đăng nhập SSO

# loginInProgress
source: Logging in...
vi: Đang đăng nhập...

# loginFailed
source: Login failed. Please try again.
vi: Đăng nhập thất bại. Vui lòng thử lại.

# loginError
source: Login error: {error}
vi: Lỗi đăng nhập: {error}

# logoutError
source: Logout error: {error}
vi: Lỗi đăng xuất: {error}

# logoutSuccess
source: Logged out successfully
vi: Đã đăng xuất thành công

# loginFooterText
source: Use your SSO account to login
vi: Sử dụng tài khoản SSO của bạn để đăng nhập

# checkAuthStatusButton
source: Check authentication status
vi: Kiểm tra trạng thái đăng nhập
